In [1]:
# The Relationship Between Series And DataFrame
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
data = {
    "Country": ["Japan", "korean", "Canada"], 
    "Capital": ["Tokyo", "Seoul", "Ottawa"],
    "Population": ["126.8", "51.47", "36.71"]
}

In [4]:
# Create DataFrame
df = DataFrame(data)
df

  Capital Country Population
0   Tokyo   Japan      126.8
1   Seoul  korean      51.47
2  Ottawa  Canada      36.71

In [5]:
df = DataFrame(data, index = ["A", "B", "C"])
df

  Capital Country Population
A   Tokyo   Japan      126.8
B   Seoul  korean      51.47
C  Ottawa  Canada      36.71

In [6]:
df[0:2]
# df.iloc[0:2]

  Capital Country Population
A   Tokyo   Japan      126.8
B   Seoul  korean      51.47

In [8]:
df.iloc[0:2, 1:2]

  Country
A   Japan
B  korean

In [9]:
df.loc["A"]

Capital       Tokyo
Country       Japan
Population    126.8
Name: A, dtype: object

In [12]:
for row in df.iterrows():
    print(row[0], row[1])
    print()

A Capital       Tokyo
Country       Japan
Population    126.8
Name: A, dtype: object

B Capital        Seoul
Country       korean
Population     51.47
Name: B, dtype: object

C Capital       Ottawa
Country       Canada
Population     36.71
Name: C, dtype: object

In [20]:
data
df

  Capital Country Population
A   Tokyo   Japan      126.8
B   Seoul  korean      51.47
C  Ottawa  Canada      36.71

In [16]:
# Seperate DataFrame
s1 = Series(data["Capital"])
s2 = Series(data["Country"])
s3 = Series(data["Population"])

In [17]:
s1

0     Tokyo
1     Seoul
2    Ottawa
dtype: object

In [22]:
# Merge DataFrame
df_new = DataFrame([s1, s2, s3])
df_new

       0       1       2
0  Tokyo   Seoul  Ottawa
1  Japan  korean  Canada
2  126.8   51.47   36.71

In [23]:
df_new.T

        0       1      2
0   Tokyo   Japan  126.8
1   Seoul  korean  51.47
2  Ottawa  Canada  36.71

In [29]:
# Change index
df_new = DataFrame([s1, s2, s3], index = ["Capital", "Country", "Population"])
df_new = df_new.T
df_new.index = ["A", "B", "C"]
df_new

  Capital Country Population
A   Tokyo   Japan      126.8
B   Seoul  korean      51.47
C  Ottawa  Canada      36.71

In [30]:
# Same as df
df

  Capital Country Population
A   Tokyo   Japan      126.8
B   Seoul  korean      51.47
C  Ottawa  Canada      36.71